tap "daipeihust/tap"
tap "homebrew/bundle"
tap "homebrew/services"
tap "koekeishiya/formulae"
tap "modularml/packages"
tap "mongodb/brew"
tap "shyiko/kubesec"
tap "ynqa/tap"
brew "argocd"
brew "ca-certificates"
brew "bat"
brew "coreutils"
brew "libidn2"
brew "gnutls"
brew "emacs"
brew "cask"
brew "colordiff"
brew "ctags"
brew "deno"
brew "docker", link: false
brew "fd"
brew "harfbuzz"
brew "leptonica"
brew "pango"
brew "tesseract"
brew "ffmpeg"
brew "fzf"
brew "git"
brew "libassuan"
brew "gnupg"
brew "go"
brew "gpgme"
brew "guile"
brew "helm"
brew "jq"
brew "kind"
brew "kubectx"
brew "kustomize"
brew "lf"
brew "minikube"
brew "mupdf"
brew "neovim"
brew "nmap"
brew "node-build"
brew "nodebrew"
brew "nodenv"
brew "openjdk"
brew "p7zip"
brew "poppler"
brew "postgresql@14"
brew "pure"
brew "py3cairo"
brew "pyenv"
brew "python@3.10"
brew "python@3.11"
brew "stern"
brew "tesseract-lang"
brew "tmux"
brew "tree"
brew "watch"
brew "wget"
brew "yarn"
brew "zsh-autosuggestions"
brew "zsh-completions"
brew "zsh-syntax-highlighting"
brew "daipeihust/tap/im-select"
brew "koekeishiya/formulae/skhd"
brew "koekeishiya/formulae/yabai"
brew "modularml/packages/modular"
brew "mongodb/brew/mongodb-community"
brew "ynqa/tap/jnv"
cask "bettertouchtool"
cask "chromium"
cask "cleanmymac", args: { appdir: "/Applications" }
cask "cmd-eikana"
cask "coteditor"
cask "dbeaver-community"
cask "docker", args: { appdir: "/Applications" }
cask "dropbox", args: { appdir: "/Applications" }
cask "google-chrome", args: { appdir: "/Applications" }
cask "google-cloud-sdk"
cask "google-drive"
cask "google-japanese-ime"
cask "hyperswitch", args: { appdir: "/Applications" }
cask "iterm2", args: { appdir: "/Applications" }
cask "microsoft-auto-update"
cask "microsoft-office", args: { appdir: "/Applications" }
cask "raycast", args: { appdir: "/Applications" }
cask "slack", args: { appdir: "/Applications" }
cask "spotify"
cask "teamviewer", args: { appdir: "/Applications" }
cask "ubersicht"
cask "visual-studio-code", args: { appdir: "/Applications" }
cask "zoom", args: { appdir: "/Applications" }
vscode "asvetliakov.vscode-neovim"
vscode "george-alisson.html-preview-vscode"
vscode "jabedhossain.web-preview"
vscode "mhutchie.git-graph"
vscode "ms-azuretools.vscode-docker"
vscode "ms-ceintl.vscode-language-pack-ja"
vscode "ms-python.debugpy"
vscode "ms-python.isort"
vscode "ms-python.python"
vscode "ms-python.vscode-pylance"
vscode "ms-toolsai.jupyter"
vscode "ms-toolsai.jupyter-keymap"
vscode "ms-toolsai.jupyter-renderers"
vscode "ms-toolsai.vscode-jupyter-cell-tags"
vscode "ms-toolsai.vscode-jupyter-slideshow"
vscode "ms-vscode-remote.remote-containers"
vscode "ms-vscode.live-server"
vscode "redhat.vscode-xml"
vscode "shd101wyy.markdown-preview-enhanced"
vscode "starkwang.markdown"
vscode "taichi.vscode-textlint"
vscode "vvakame.vscode-prh-extention"
vscode "yzane.markdown-pdf"
vscode "yzhang.markdown-all-in-one"
