cask_args appdir: "/Applications"

tap "daipeihust/tap"
tap "homebrew/bundle"
tap "homebrew/cask"
tap "homebrew/core"
tap "homebrew/services"
tap "shyiko/kubesec"

brew "ca-certificates"
brew "coreutils"
brew "libidn2"
brew "gnutls"
brew "emacs"
brew "cask"
brew "ctags"
brew "deno"
brew "docker", link: false
brew "fd"
brew "fzf"
brew "git"
brew "jq"
brew "lf"
brew "neovim"
brew "node-build"
brew "nodebrew"
brew "nodenv"
brew "postgresql@14"
brew "pure"
brew "tmux"
brew "tree"
brew "watch"
brew "wget"
brew "zsh-autosuggestions"
brew "zsh-completions"
brew "daipeihust/tap/im-select"

cask "cleanmymac"
cask "docker"
cask "dropbox"
cask "google-chrome"
cask "google-cloud-sdk"
cask "iterm2"
cask "karabiner-elements"
cask "raycast"
cask "slack"
cask "visual-studio-code"
cask "sidekick"
cask "hyperswitch"
cask "spectacle"
